murray-lang/nexusdr/src/app/stm32h745i/CM7/App/Inc/config.h
#ifndef __CONFIG_H__
#define __CONFIG_H__

#ifdef __cplusplus
 extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include <stdbool.h>
#include "stm32h7xx_hal.h"
#include "stm32h745i_discovery.h"
#include "ff_gen_drv.h"
#include "mmc_diskio.h"


/* Exported types ------------------------------------------------------------*/
/* Exported variables --------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/
/* Definition for USARTx clock resources */
#define USARTx                           USART3
#define USARTx_CLK_ENABLE()              __HAL_RCC_USART3_CLK_ENABLE()
#define USARTx_RX_GPIO_CLK_ENABLE()      __HAL_RCC_GPIOB_CLK_ENABLE()
#define USARTx_TX_GPIO_CLK_ENABLE()      __HAL_RCC_GPIOB_CLK_ENABLE()

#define USARTx_FORCE_RESET()             __HAL_RCC_USART3_FORCE_RESET()
#define USARTx_RELEASE_RESET()           __HAL_RCC_USART3_RELEASE_RESET()

/* Definition for USARTx Pins */
#define USARTx_TX_PIN                    GPIO_PIN_10
#define USARTx_TX_GPIO_PORT              GPIOB
#define USARTx_TX_AF                     GPIO_AF7_USART3
#define USARTx_RX_PIN                    GPIO_PIN_11
#define USARTx_RX_GPIO_PORT              GPIOB
#define USARTx_RX_AF                     GPIO_AF7_USART3

/* Definition for USARTx's NVIC IRQ and IRQ Handlers */
#define USARTx_IRQn                      USART3_IRQn
#define USARTx_IRQHandler                USART3_IRQHandler

/* Definition for USARTx peripheral clock configuration */
#define USARTx_PERIPHCLK                 RCC_PERIPHCLK_USART3
#define USARTx_CLKSOURCE                 RCC_USART234578CLKSOURCE_HSI

// #define USARTx                           USART6
// #define USARTx_CLK_ENABLE()              __HAL_RCC_USART6_CLK_ENABLE()
// #define USARTx_RX_GPIO_CLK_ENABLE()      __HAL_RCC_GPIOC_CLK_ENABLE()
// #define USARTx_TX_GPIO_CLK_ENABLE()      __HAL_RCC_GPIOC_CLK_ENABLE()
//
// #define USARTx_FORCE_RESET()             __HAL_RCC_USART6_FORCE_RESET()
// #define USARTx_RELEASE_RESET()           __HAL_RCC_USART6_RELEASE_RESET()
//
// /* Definition for USARTx Pins */
// #define USARTx_TX_PIN                    GPIO_PIN_6
// #define USARTx_TX_GPIO_PORT              GPIOC
// #define USARTx_TX_AF                     GPIO_AF7_USART6
// #define USARTx_RX_PIN                    GPIO_PIN_7
// #define USARTx_RX_GPIO_PORT              GPIOC
// #define USARTx_RX_AF                     GPIO_AF7_USART6
//
// /* Definition for USARTx's NVIC IRQ and IRQ Handlers */
// #define USARTx_IRQn                      USART6_IRQn
// #define USARTx_IRQHandler                USART6_IRQHandler

/* Definition for USARTx peripheral clock configuration */
// #define USARTx_PERIPHCLK                 RCC_PERIPHCLK_USART6
// #define USARTx_CLKSOURCE                 RCC_USART234578CLKSOURCE_HSI

#define SDIO1_D2_Pin GPIO_PIN_10
#define SDIO1_D2_GPIO_Port GPIOC
#define LCD_DISP_Pin GPIO_PIN_15
#define LCD_DISP_GPIO_Port GPIOJ
#define SDIO1_D3_Pin GPIO_PIN_11
#define SDIO1_D3_GPIO_Port GPIOC
#define OSC32_OUT_Pin GPIO_PIN_15
#define OSC32_OUT_GPIO_Port GPIOC
#define OSC32_IN_Pin GPIO_PIN_14
#define OSC32_IN_GPIO_Port GPIOC
#define SDIO1_CK_Pin GPIO_PIN_12
#define SDIO1_CK_GPIO_Port GPIOC
#define SDIO1_D5_Pin GPIO_PIN_9
#define SDIO1_D5_GPIO_Port GPIOB
#define SDIO1_D4_Pin GPIO_PIN_8
#define SDIO1_D4_GPIO_Port GPIOB
#define SDIO1_CMD_Pin GPIO_PIN_2
#define SDIO1_CMD_GPIO_Port GPIOD
#define VBUS_FS2_Pin GPIO_PIN_9
#define VBUS_FS2_GPIO_Port GPIOA
#define SDIO1_D0_Pin GPIO_PIN_8
#define SDIO1_D0_GPIO_Port GPIOC
#define SDIO1_D1_Pin GPIO_PIN_9
#define SDIO1_D1_GPIO_Port GPIOC
#define USB_OTG_FS2_P_Pin GPIO_PIN_12
#define USB_OTG_FS2_P_GPIO_Port GPIOA
#define USB_OTG_FS2_N_Pin GPIO_PIN_11
#define USB_OTG_FS2_N_GPIO_Port GPIOA
#define SDIO1_D7_Pin GPIO_PIN_7
#define SDIO1_D7_GPIO_Port GPIOC
#define SDIO1_D6_Pin GPIO_PIN_6
#define SDIO1_D6_GPIO_Port GPIOC
#define OSC_OUT_Pin GPIO_PIN_1
#define OSC_OUT_GPIO_Port GPIOH
#define OSC_IN_Pin GPIO_PIN_0
#define OSC_IN_GPIO_Port GPIOH

extern UART_HandleTypeDef     UartHandle;

/* Exported macro ------------------------------------------------------------*/

#define HSEM_ID_0 (0U) /* HW semaphore 0*/
#define UART_HSEM_ID (2U) /* HW semaphore 0*/

#define LOCK_HSEM(__sem__)   while(HAL_HSEM_FastTake(__sem__) != HAL_OK) {}
#define UNLOCK_HSEM(__sem__)  HAL_HSEM_Release(__sem__, 0)

#ifdef __GNUC__
/* With GCC/RAISONANCE, small printf (option LD Linker->Libraries->Small printf
set to 'Yes') calls __io_putchar() */
#define PUTCHAR_PROTOTYPE int __io_putchar(int ch)
#else
#define PUTCHAR_PROTOTYPE int fputc(int ch, FILE *f)
#endif /* __GNUC__ */

/* Exported functions ------------------------------------------------------- */
extern void MPU_Config(void);
extern void CPU_CACHE_Enable(void);
extern void SystemClock_Config(void);
extern void PeriphCommonClock_Config(void);
extern void Error_Handler(void);
extern void UART_Config(void);
extern void USB_Device_Init(void);


extern void MX_GPIO_Init(void);
extern void MX_DMA_Init(void);
// extern void MX_DMA2D_Init(void);
extern void MX_FMC_Init(void);
// extern void MX_LTDC_Init(void);

extern void MX_QUADSPI_Init(void);
extern void MX_SDMMC1_MMC_Init(void);
extern void MX_USB_OTG_FS_USB_Init(void);

//--------------------------------------------------------------------+
// TinyUSB Device Callbacks
//--------------------------------------------------------------------+
// Invoked when device is mounted
extern void tud_mount_cb(void);

// Invoked when device is unmounted
extern void tud_umount_cb(void);

// Invoked when usb bus is suspended
extern void tud_suspend_cb(bool remote_wakeup_en);

// Invoked when usb bus is resumed
extern void tud_resume_cb(void);

#ifdef __cplusplus
 }
#endif

#endif // __CONFIG_H__